src/cf/InformationRegisters/Infor_СтатусыВМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Infor_СтатусыВМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Infor_СтатусыВМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/new_ОтправкаСМСКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>new_ОтправкаСМСКлиентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекстОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/Infor_СтатусыВМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Infor_СтатусыВМС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упаковывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗапущено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпаковкаЗавершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастьЗарезервирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выпущено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаЗавершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказУдалён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданоВнешне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастьОтгружена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарезервировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытСПроверкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастьОтобрана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарезервировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдетПриемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПустойЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданоВнутренне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСостоянииЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастьВыпущена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяВРаспоряжении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/смсТрафик/Ext/Module.bsl
Функция ПолучитьКодПодтверждения() Экспорт
	ГСЧ =  Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(10000, 99999);
	Возврат СтрЗАменить(СлучайноеЧисло," ","")
КонецФункции 

Функция ОтправитьСМССообщениеПоНомеру(Телефон, Сообщение, Дост = Неопределено) Экспорт
	
	Объект  = Обработки.bon_ОбработкаСМС.Создать();
	СмсИД   = Объект.ОтправитьСМССообщениеПоНомеру(Телефон, Сообщение, Дост);
	
	//Если вернулась структура - значит включен старый поставщик.
	Если ТипЗнч(СмсИД)=Тип("Структура") Тогда
		Возврат СмсИд;
	КонецЕсли;
	//отправили. 
	Если СмсИД = "-1" ИЛИ Лев(СмсИД, 1)= "{" Тогда  //Обработка ошибки
		Результат = Ложь;
		Описание  = "Ошибка при отправке";
	ИначеЕсли ТипЗнч(СмсИД) = ТИП("Строка") Тогда  //Успех
		Результат = Истина;
		Описание  = "Количество отправленных сообщений  1";
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ид",СмсИД);
	СтруктураДанных.Вставить("Результат",Результат);
	СтруктураДанных.Вставить("Описание",Описание);	
	Возврат СтруктураДанных;
	
КонецФункции



///Сергей 10.11.2020 +++ Формируем список для отправки смс по самовывозу
Процедура СформироватьСписокПоСамоВывозу() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Infor_СтатусыВМС.Объект КАК СсылкаЗаказ,
	|	Infor_СтатусыВМС.Объект.Контрагент КАК Контрагент,
	|	Infor_СтатусыВМС.Объект.Контрагент.Партнер КАК Партнер
	|ПОМЕСТИТЬ ТабОбъект
	|ИЗ
	|	РегистрСведений.Infor_СтатусыВМС КАК Infor_СтатусыВМС
	|ГДЕ
	|	Infor_СтатусыВМС.Склад = &Склад
	|	И Infor_СтатусыВМС.СтатусЗаказа = &СтатусЗаказа
	|	И Infor_СтатусыВМС.Объект ССЫЛКА Документ.ЗаказКлиента
	|	И Infor_СтатусыВМС.Объект.Дата >= &ДатаНач
	|	И Infor_СтатусыВМС.Объект.Статус <> &СтатусЗакрыт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОбъект.СсылкаЗаказ КАК СсылкаЗаказ,
	|	ТабОбъект.Контрагент КАК Контрагент,
	|	ТабОбъект.Партнер КАК Партнер,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефона,
	|	ЕСТЬNULL(ПартнерыДополнительныеРеквизитыСМС.Значение, ЛОЖЬ) КАК ОтправлятьСМС
	|ПОМЕСТИТЬ ТабРезСНом
	|ИЗ
	|	ТабОбъект КАК ТабОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ПО ТабОбъект.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыСМС
	|		ПО ТабОбъект.Партнер = ПартнерыДополнительныеРеквизитыСМС.Ссылка
	|			И (ПартнерыДополнительныеРеквизитыСМС.Свойство = &СМСУведомление)
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезСНом.СсылкаЗаказ КАК СсылкаЗаказ,
	|	ТабРезСНом.Контрагент КАК Контрагент,
	|	ТабРезСНом.Партнер КАК Партнер,
	|	ТабРезСНом.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	ТабРезСНом КАК ТабРезСНом
	|ГДЕ
	|	(ТабРезСНом.Партнер.ЮрФизЛицо = &ЮрФизЛицо
	|			ИЛИ ТабРезСНом.ОтправлятьСМС = ИСТИНА)
	|	И ТабРезСНом.СсылкаЗаказ.СпособДоставки = &СпособДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабРезСНом.СсылкаЗаказ,
	|	ТабРезСНом.Контрагент,
	|	ТабРезСНом.Партнер,
	|	ТабРезСНом.НомерТелефона";
	Запрос.УстановитьПараметр("Склад", 			Справочники.Склады.НайтиПоНаименованию("Альфа Логистик WMS"));
	Запрос.УстановитьПараметр("СтатусЗаказа", 	Перечисления.Infor_СтатусыВМС.УпаковкаЗавершена);
	Запрос.УстановитьПараметр("ДатаНач", 		НачалоДня('20201111'));
	Запрос.УстановитьПараметр("Тип", 			Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ЮрФизЛицо", 		Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
	Запрос.УстановитьПараметр("СпособДоставки", Перечисления.СпособыДоставки.Самовывоз);
	Запрос.УстановитьПараметр("СтатусЗакрыт", 	Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	Запрос.УстановитьПараметр("СМСУведомление", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","SMSУведомление"));
	
	РезЗап = Запрос.Выполнить().Выгрузить();
	
	ТзДанСамовывоз = Новый ТаблицаЗначений;	
	ТзДанСамовывоз.Колонки.Добавить("СсылкаЗаказ",,"СсылкаЗаказ");
	ТзДанСамовывоз.Колонки.Добавить("Контрагент",,"Контрагент");
	ТзДанСамовывоз.Колонки.Добавить("Партнер",,"Партнер");
	ТзДанСамовывоз.Колонки.Добавить("НомерТелефона",,"НомерТелефона");
	
	Если РезЗап.Количество() > 0 Тогда
		Для Каждого ТабЗнач Из РезЗап Цикл 
			///------------------------------------------///
			///Проверка на заполнение номера
			Если СтрДлина(ТабЗнач.НомерТелефона) <> 10 Тогда
				Продолжить;
			КонецЕсли;
			
			///Проверка чтобы были только "Цифры"
			Цифры = "0123456789";
			СтрКоличество = СтрДлина(ТабЗнач.НомерТелефона);
			Для Счетчик = 1 По СтрКоличество Цикл
				Если Найти(Цифры,Сред(ТабЗнач.НомерТелефона, Счетчик, 1)) = 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			///Проверка на первую цыфору чтобы бала "7"
			Если Число(Сред(ТабЗнач.НомерТелефона, 1 ,1)) <> 7 Тогда
				Продолжить;	
			КонецЕсли;			
			///-----------------------------------------///
			
			ЕстьСовпад = Число(0);
			Если ТзДанСамовывоз.Количество() = 0 Тогда			
				НовСтр = ТзДанСамовывоз.Добавить();
				НовСтр.СсылкаЗаказ 		= ТабЗнач.СсылкаЗаказ;
				НовСтр.Контрагент 		= ТабЗнач.Контрагент;
				НовСтр.Партнер 			= ТабЗнач.Партнер;
				НовСтр.НомерТелефона 	= ТабЗнач.НомерТелефона;
				ЕстьСовпад = ЕстьСовпад + Число(1);
			Иначе 
				Для Каждого СтрНабДан Из ТзДанСамовывоз Цикл
					Если ТабЗнач.СсылкаЗаказ = СтрНабДан.СсылкаЗаказ Тогда
						ЕстьСовпад = ЕстьСовпад + Число(0);	
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;
			
			Если ЕстьСовпад = Число(0) Тогда
				НовСтр = ТзДанСамовывоз.Добавить();
				НовСтр.СсылкаЗаказ 		= ТабЗнач.СсылкаЗаказ;
				НовСтр.Контрагент 		= ТабЗнач.Контрагент;
				НовСтр.Партнер 			= ТабЗнач.Партнер;
				НовСтр.НомерТелефона 	= ТабЗнач.НомерТелефона;
			КонецЕсли;
		КонецЦикла;                                       		
	КонецЕсли;	
	
	Если ТзДанСамовывоз.Количество() > 0 Тогда
		Для Каждого СтрОбх Из ТзДанСамовывоз Цикл 	
			ДаныеВРег = Новый Запрос;
			ДаныеВРег.Текст = "ВЫБРАТЬ
			|	new_ОтправкаСМСКлиентам.Документ КАК Документ,
			|	new_ОтправкаСМСКлиентам.Контрагент КАК Контрагент,
			|	new_ОтправкаСМСКлиентам.Телефон КАК Телефон
			|ИЗ
			|	РегистрСведений.new_ОтправкаСМСКлиентам КАК new_ОтправкаСМСКлиентам
			|ГДЕ
			|	new_ОтправкаСМСКлиентам.Документ = &Документ";
			ДаныеВРег.УстановитьПараметр("Документ", СтрОбх.СсылкаЗаказ);
			
			РезДаныеВРег = ДаныеВРег.Выполнить().Выгрузить();
			
			Если РезДаныеВРег.Количество() = Число(0) Тогда
				///---Добавляем запись---\\\
				МенеджерЗаписи = РегистрыСведений.new_ОтправкаСМСКлиентам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Телефон 				= СтрОбх.НомерТелефона;  
				МенеджерЗаписи.Контрагент 			= СтрОбх.Контрагент;
				МенеджерЗаписи.Документ 			= СтрОбх.СсылкаЗаказ;
				МенеджерЗаписи.ДатаЗаписи 			= ТекущаяДата();
				МенеджерЗаписи.ТекстОтправки 		= Константы.bon_ТекстОтправкиСМСОСамовывозе.Получить();
				МенеджерЗаписи.Записать();
				///---Добавляем запись---\\\
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры
///Сергей 10.11.2020 --- Формируем список для отправки смс по самовывозу

///Сергей 10.11.2020 +++ ///---Отправляем смс по самовывозу---\\\
Процедура ОтправитьСМСсРегистраnew_ОтправкаСМСКлиентам() Экспорт 
	
	НаборЗаписей = РегистрыСведений.new_ОтправкаСМСКлиентам.СоздатьНаборЗаписей();
	Отбор = НаборЗаписей.Отбор;
	Отбор.Отправлено.Установить(Ложь);
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	new_ОтправкаСМСКлиентам.Телефон КАК Телефон,
	               |	new_ОтправкаСМСКлиентам.Контрагент КАК Контрагент,
	               |	new_ОтправкаСМСКлиентам.Документ КАК Документ,
	               |	new_ОтправкаСМСКлиентам.ДатаЗаписи КАК ДатаЗаписи,
	               |	new_ОтправкаСМСКлиентам.ДатаОтправки КАК ДатаОтправки,
	               |	new_ОтправкаСМСКлиентам.Отправлено КАК Отправлено,
	               |	new_ОтправкаСМСКлиентам.ТекстОтправки КАК ТекстОтправки
	               |ИЗ
	               |	РегистрСведений.new_ОтправкаСМСКлиентам КАК new_ОтправкаСМСКлиентам
	               |ГДЕ
	               |	new_ОтправкаСМСКлиентам.Отправлено = ЛОЖЬ";
	РезДан = Запрос.Выполнить().Выгрузить();
	
	
	
	Если РезДан.Количество() > 0 Тогда
		Для каждого Запись Из РезДан Цикл
			НаборЗаписей = РегистрыСведений.new_ОтправкаСМСКлиентам.СоздатьНаборЗаписей();
			Отбор = НаборЗаписей.Отбор;
			Отбор.Документ.Установить(Запись.Документ);
			Отбор.ДатаЗаписи.Установить(Запись.ДатаЗаписи);
			Отбор.Телефон.Установить(Запись.Телефон);
			НаборЗаписей.Прочитать();	
			
			Для Каждого ЗаписьПолуч Из НаборЗаписей Цикл  
				ЗаписьПолуч.ДатаОтправки = ТекущаяДата();		
				
				ТекстСообщения = ЗаписьПолуч.ТекстОтправки;
				Дост=Число(88);
				ТелефонСотовыйСМС	= "7"+Прав(ЗаписьПолуч.Телефон, 10);
				Структура = ОтправитьСМССообщениеПоНомеру(ТелефонСотовыйСМС, ТекстСообщения, Дост);
				Ответ = Структура.Описание + " " + Структура.Ид;
				Если Структура.Результат = Истина Тогда
					ЗаписьПолуч.Отправлено = Истина;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
///Сергей 10.11.2020 --- ///---Отправляем смс по самовывозу---\\\
